app/controllers/tweets_controller.rb

  def create
    @tweet = Tweet.new(tweet_params)

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "aaaaaaaaaaaaaaaaaaaaaaaa"], ["user_id", 1], ["created_at", "2015-03-18 13:14:10.686997"], ["updated_at", "2015-03-18 13:14:10.686997"]]

  def destroy
    @tweet.destroy
---
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 1]]